app/controllers/home_controller.rb

SELECT  "voters".* FROM "voters" WHERE "voters"."email" = ? LIMIT ?  [["email", "pabelnunezl@gmail.com"], ["LIMIT", 1]]
---
  def vote
    voter = Voter.new
    error = []
    # Verify params and email format
    if vote_params[:user][:email].present?
      if EmailValidator.valid?(vote_params[:user][:email])
        voter.email = vote_params[:user][:email]
        if _ = Voter.where(email: voter.email).take

UPDATE "voters" SET "confirmed" = ?, "updated_at" = ? WHERE "voters"."id" = ?  [["confirmed", 1], ["updated_at", "2018-11-12 17:05:53.639755"], ["id", 1]]
INSERT INTO "voters" ("created_at", "updated_at", "email", "mmgvo", "revelacion", "infeliz", "confirmation_token", "confirmed") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    voter.confirmation_token = random_string
    voter.confirmed = false
    # Save new voter to db
    voter.save

SELECT COUNT(*) FROM "voters" WHERE "voters"."mmgvo" = ?  [["mmgvo", "Gabriela"]]
SELECT "voters"."mmgvo", COUNT("voters"."mmgvo") FROM "voters"
SELECT COUNT(*) FROM "voters" WHERE "voters"."revelacion" = ?  [["revelacion", "Pabel"]]
SELECT "voters"."revelacion", COUNT("voters"."revelacion") FROM "voters"
SELECT COUNT(*) FROM "voters" WHERE "voters"."infeliz" = ?  [["infeliz", "Yamil"]]
SELECT "voters"."infeliz", COUNT("voters"."infeliz") FROM "voters"
SELECT "voters".* FROM "voters" WHERE "voters"."confirmed" = ? ORDER BY "voters"."created_at" DESC  [["confirmed", 1]]
---
  def result
    @mmgvoWinner = Voter.select([:mmgvo, Voter.arel_table[:mmgvo].count]).to_a
    @revelacionesWinner = Voter.select([:revelacion, Voter.arel_table[:revelacion].count]).to_a
    @infelicesWinner = Voter.select([:infeliz, Voter.arel_table[:infeliz].count]).to_a

    @votes = Voter.where(confirmed: true)