app/controllers/home_controller.rb

SELECT  "voters".* FROM "voters" WHERE "voters"."confirmation_token" = ? LIMIT ?  [["confirmation_token", "e0888819a724251b3e595913c3683f70"], ["LIMIT", 1]]
UPDATE "voters" SET "confirmed" = ?, "updated_at" = ? WHERE "voters"."id" = ?  [["confirmed", 1], ["updated_at", "2018-11-12 17:05:53.639755"], ["id", 1]]
---
  def confirm
    # return render :template => "voter_mailer/voter_email"
    error = []
    if params[:token].present?
      if voter = Voter.where(confirmation_token: params[:token]).take
        if voter.confirmed == true
          error.push("Esta votacion ya fue confirmada.")
        else
          voter.confirmed = true
          voter.save

SELECT  "voters"."mmgvo", COUNT("voters"."mmgvo") FROM "voters" GROUP BY "voters"."mmgvo" LIMIT ?  [["LIMIT", 11]]
SELECT  "voters"."revelacion", COUNT("voters"."revelacion") FROM "voters" LIMIT ?  [["LIMIT", 11]]
SELECT  "voters"."infeliz", COUNT("voters"."infeliz") FROM "voters" LIMIT ?  [["LIMIT", 11]]
---
  def result
    @error = []
    if params[:active].present?
      if params[:active] = "ok"
        @mmgvoWinner = Voter.select([:mmgvo, Arel.star.count]).having(Arel.star.count.gt(1)).group(:mmgvo)
        if not @mmgvoWinner.first.nil?
          @mmgvoWinnerCount = Voter.select(Arel.star.count).where(Voter.arel_table[:mmgvo].eq(@mmgvoWinner.first["mmgvo"])).size
        end

        @revelacionesWinner = Voter.select([:revelacion, Arel.star.count]).having(Arel.star.count.gt(1)).group(:revelacion)
        if not @revelacionesWinner.first.nil?
          @revelacionesWinnerCount = Voter.select(Arel.star.count).where(Voter.arel_table[:revelacion].eq(@revelacionesWinner.first["revelacion"])).size
        end

        @infelicesWinner = Voter.select([:infeliz, Arel.star.count]).having(Arel.star.count.gt(1)).group(:infeliz)