app/controllers/home_controller.rb

  def result
    @error = []
    if params[:active].present?
      if params[:active] = "ok"
        # Query for the mmgvo winner
        @mmgvoWinner = []
        queryMmgvo = Voter.select("COUNT(mmgvo) as total, mmgvo").where(:confirmed => true).group(:mmgvo).having("COUNT(mmgvo) > 1").order(:mmgvo).map{|p| {:mmgvo => p.mmgvo, :total => p.total} }
        if not queryMmgvo.nil?
          @mmgvoWinner = queryMmgvo.group_by { |x| x[:total] }.max.last
---
SELECT  "voters".* FROM "voters" WHERE "voters"."confirmed" = ? ORDER BY "voters"."created_at" DESC LIMIT ?  [["confirmed", 1], ["LIMIT", 11]]